#ΕΛΛΗΝΙΚΗ ΑΡΙΘΜΟΜΙΧΑΝΗ#🇬🇷🇬🇷
#Created by Ελένης Μάριος. Με την ευγενική χορηγία και βοήθεια του συνάδελφου και πολύ αγαπητού μου φίλου Σταθερού Δημήτριου.
#Για να συμπληρωθεί ο δυαδικός τελεστής της ρίζας πληκτρολογήστε δυο κάθετους. --> // 
import math 
συν = "Ναι"
while συν == "Ναι" :
 A1= float(input("Πρώτος αριθμός: "))
 πραξ=input("Δώσε δυαδικό τελεστή: ")
 if πραξ=="//":
  Α2=0
 else:
  A2=float(input('Δεύτερος Αριθμός: '))
 if πραξ=='+':
       print( A1 ,"+", A2 , "=",(A1+A2))
 elif πραξ=='-':
        print(A1 ,"-", A2 , "=",(A1-A2))
 elif πραξ=='*':
        print(A1 ,"+", A2 , "=",(A1*A2))
 elif πραξ=='/':
       print(A1 ,"/", A2 , "=",(A1/A2))
 elif πραξ=='**':
        print(A1 ,"**", A2 , "=",(A1**A2))
 elif πραξ=="//":
      print(math.sqrt(A1))
 else:
       print("Αδύνατη πράξη ):")
 συν=input("Θες να συνεχίσεις; Ναι/Οχι: ")
 if συν == "Οχι":
       print("Σε ευχαριστώ που με χρησιμοποίησες. :)")
       break  